package org.example.excelgenerator.helper;

public class StaticData {
    public static String[][] staticData1 = {
            {"АНДЕРРАЙТЕР ХУЛОСАСИ", "", "", ""},
            {"1", "Сана:", "03.02.2025 йил", ""},
            {"2", "Хизмат кўрсатувчи БХО:", "Кўклон БХМ", ""},
            {"3", "Корхона номи:", "\"SHODLIK TECHNO\" МЧЖ", ""},
            {"4", "Уникал:", "01024509", ""},
            {"5", "ID заявки:", "2845623", ""},
            {"6", "ИНН:", "306110816", ""},
            {"7", "Андеррайтерга тўлиқ юборилган сана", "03.02.2025 йил", ""},
            {"\"Универсал\" кредит  махсулоти паспортига мослиги", "", "", ""},
            {"№", "Керакли маълумотлар/хужжатлар:", "Кредит маҳсулот паспорти бўйича талаб", "Хакикатда хужжатлар ва маълумотларнинг \"Анкета\" дастурида мослиги"},
            {"1", "Ариза", "", ""},
            {"", "Мижоз аризаси санаси", "-", ""},
            {"", "Кирим қилинган сана", "-", ""},
            {"", "Мижоз ҳисоб рақами", "Асосий / иккиламчи", ""},
            {"", "Кредит мақсади", "Мақсадлилик тамойили мавжуд эмас", ""},
            {"", "Кредит миқдори", "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд мижозларга - 5 000 000 000 сўмгача;\n" +
                    "\uF0B7“Бизнесни ривожлантириш банки” АТБ тизимида иккиламчи ҳисоб \n" +
                    "рақами мавжуд мижозларга - 1 000 000 000 сўмгача;\n" +
                    "Бунда,тадбиркорлик субектларининг мулкчилик шаклидан келиб чиқиб қуйидагича тақсимланади:\n" +
                    "\uF0B7 600,0 млн.сўмгача - ЯТТларга;\n" +
                    "\uF0B7 1 000,0 млн.сўмгача - микрофирмалар (жами даромади \n" +
                    "охирги 12 ойда 1,0 млрд.сўмгача бўлган тадбиркорлик субектлари);\n" +
                    "\uF0B7 5 000,0 млн.сўмгача - кичик корхоналар (жами даромади \n" +
                    "охирги 12 ойда 1,0 млрд.сўмдан 10,0 млрд.сўмгача бўлган тадбиркорлик субектлари);\n" +
                    "\uF0B7 5 000,0 млн.сўмгача - ўрта тадбиркорлик субектлари (жами даромади \n" +
                    "охирги 12 ойда 10,0 млрд.сўмдан юқори бўлган тадбиркорлик субектлари).", ""},
            {"", "Кредит муддати", " “Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд мижозларга - 36 ойгача;\n" +
                    "\uF0B7 “Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлмаган мижозларга - 24 ойгача;\n" +
                    "\uF0B7 24 ой муддатгача Бош келишув имзоланган ҳолда \n" +
                    "индивидуал кредит шартномаларига асосан 12 ойгача очиқ кредит линияси орқали (револвер шаклда) кредит ажратилиши мумкин.", ""},
            {"", "Имтиёзли давр", "6 ойгача", ""},
            {"", "Фоизи", "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлганда;\n" +
                    "Кредит муддати 12 ойгача - 27%\n" +
                    "Кредит муддати 12 ойдан 24 ойгача - 28%\n" +
                    "Кредит муддати 24 ойдан 36 ойгача - 30%\n" +
                    "24 ой муддатгача Бош келишув имзолаган ҳолда индивидуал кредит шартномаларига асосан 12 ойгача очиқ кредит линияси орқали (револьвер шаклда) кредит ажратилганда - 27%.\n" +
                    "\n" +
                    "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлмаганда;\n" +
                    "Кредит муддати 12 ойгача - 28%\n" +
                    "Кредит муддати 12 ойдан 24 ойгача - 29%", ""},
            {"", "Кредитлаш усули", "Очиқ ва опиқ кредит линияси орқали", ""},
            {"", "Кредит валютаси", "Миллий валюта (сўм)", ""},
            {"", "Молиялаштириш манбаи", "Банк ўз маблағи ва (ёки) жалб қилинган маблағлари ҳисобидан", ""},
            {"", "Кредитни ажратиш шакли", "Мижознинг \"Бизнесни ривожлантириш банки\" АТБ тизимида очилган асосий ёки иккиламчи хисоб рақамига пул ўтказиб берилади.", ""},
            {"", "Қўшимча шарт", "Агар мавжуд бўлса", ""},
            {"2", "Қарз олувчининг таъсис ҳужжатлари (устав, гувоҳнома, паспорт нусхалари, имзо наъмунаси)", "", ""},
            {"", "Юридик манзили (Низом)", "", ""},
            {"", "Корхона ташкил топган сана", "", ""},
            {"", "Таъсисчилар ва уларнинг улуши (stat.uz )", "", ""},
            {"", "Кредит олиш қарори", "", ""},
            {"", "Низом жамғармаси суммаси", "", ""},
            {"", "Асосий фаолияти (Низом бўйича)", "", ""},
            {"3", "Кредит ахборот тахлилий маркази (КАТМ) маълумотлари", "", ""},
            {"", "Ижобий кредит тарихига эга бўлиши", "Мавжуд амалдаги кредитлари сони", ""},
            {"", "", "Мавжуд амалдаги кредитлари қолдиғи", ""},
            {"", "", "Мавжуд кредитлари бўйича муддати ўтган асосий/ фоиз қарздорлиги тўғрисида", ""},
            {"", "", "Мижознинг суд жараёнидаги кредит қолдиқлари ва балансдан ташқари \n" +
                    "ҳисобвараққа ўтказилган кредит асосий қарзи ва фоизлари мавжуд бўлмаслиги", ""},
            {"", "", "KATM бали 200 баллдан юқори бўлиши", ""},
            {"", "", "Ўзаро алоқадор тадбиркорлик субъектларининг номи\n" +
                    "(orginfo.uz сайти орқали ўрганилди)", ""},
            {"", "", "Ўзаро алоқадор тадбиркорлик субъектларининг “БРБ ” АТБ муддати ўтган қарздорликлари мавжуд бўлмаслиги", ""},
            {"", "Кредитлар бўйича охирги 24 ой ичида:", "", ""},
            {"", "30 кундан ошган муддати ўтган қарздорликлари ", "10 тадан кўп бўлмаслиги", ""},
            {"", "60 кундан ошган муддати ўтган қарздорликлари ", "2 тадан кўп бўлмаслиги", ""},
            {"", "90 кундан ошган муддати ўтган қарздорликлари ", "1 тадан кўп бўлмаслиги;", ""},
            {"", "Охирги 12 ой ичида 90 кундан ошган муддати ўтган қарздорликлари", "умуман бўлмаслиги;", ""},
            {"4", "Мавжуд кредитлари тўғрисида маълумот", "", ""},
            {"", "Кредитнинг шартнома суммаси", "", ""},
            {"", "Кредит қолдиғи", "", ""},
            {"", "Кредит қолдиғи", "", ""},
            {"", "Мақсади", "", ""},
            {"", "Муддати", "", ""},
            {"", "Муддати ўтган график суммаси", "", ""},
            {"", "Муддати ўтган фоиз суммаси", "", ""},
            {"", "Мавжуд таъминотлари", "", ""}
    };
}
