package org.example.excelgenerator.helper;

public class StaticData {
    public static String[][] staticData1 = {
            {"АНДЕРРАЙТЕР ХУЛОСАСИ", "", "", ""},
            {"1", "Сана:", "03.02.2025 йил", ""},
            {"2", "Хизмат кўрсатувчи БХО:", "Кўклон БХМ", ""},
            {"3", "Корхона номи:", "\"SHODLIK TECHNO\" МЧЖ", ""},
            {"4", "Уникал:", "01024509", ""},
            {"5", "ID заявки:", "2845623", ""},
            {"6", "ИНН:", "306110816", ""},
            {"7", "Андеррайтерга тўлиқ юборилган сана", "03.02.2025 йил", ""},
            {"\"Универсал\" кредит  махсулоти паспортига мослиги", "", "", ""},
            {"№", "Керакли маълумотлар/хужжатлар:", "Кредит маҳсулот паспорти бўйича талаб", "Хакикатда хужжатлар ва маълумотларнинг \"Анкета\" дастурида мослиги"},
            {"1", "Ариза", "", ""},
            {"", "Мижоз аризаси санаси", "-", ""},
            {"", "Кирим қилинган сана", "-", ""},
            {"", "Мижоз ҳисоб рақами", "Асосий / иккиламчи", ""},
            {"", "Кредит мақсади", "Мақсадлилик тамойили мавжуд эмас", ""},
            {"", "Кредит миқдори", "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд мижозларга - 5 000 000 000 сўмгача;\n" +
                    "\uF0B7“Бизнесни ривожлантириш банки” АТБ тизимида иккиламчи ҳисоб \n" +
                    "рақами мавжуд мижозларга - 1 000 000 000 сўмгача;\n" +
                    "Бунда,тадбиркорлик субектларининг мулкчилик шаклидан келиб чиқиб қуйидагича тақсимланади:\n" +
                    "\uF0B7 600,0 млн.сўмгача - ЯТТларга;\n" +
                    "\uF0B7 1 000,0 млн.сўмгача - микрофирмалар (жами даромади \n" +
                    "охирги 12 ойда 1,0 млрд.сўмгача бўлган тадбиркорлик субектлари);\n" +
                    "\uF0B7 5 000,0 млн.сўмгача - кичик корхоналар (жами даромади \n" +
                    "охирги 12 ойда 1,0 млрд.сўмдан 10,0 млрд.сўмгача бўлган тадбиркорлик субектлари);\n" +
                    "\uF0B7 5 000,0 млн.сўмгача - ўрта тадбиркорлик субектлари (жами даромади \n" +
                    "охирги 12 ойда 10,0 млрд.сўмдан юқори бўлган тадбиркорлик субектлари).", ""},
            {"", "Кредит муддати", " “Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд мижозларга - 36 ойгача;\n" +
                    "\uF0B7 “Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлмаган мижозларга - 24 ойгача;\n" +
                    "\uF0B7 24 ой муддатгача Бош келишув имзоланган ҳолда \n" +
                    "индивидуал кредит шартномаларига асосан 12 ойгача очиқ кредит линияси орқали (револвер шаклда) кредит ажратилиши мумкин.", ""},
            {"", "Имтиёзли давр", "6 ойгача", ""},
            {"", "Фоизи", "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлганда;\n" +
                    "Кредит муддати 12 ойгача - 27%\n" +
                    "Кредит муддати 12 ойдан 24 ойгача - 28%\n" +
                    "Кредит муддати 24 ойдан 36 ойгача - 30%\n" +
                    "24 ой муддатгача Бош келишув имзолаган ҳолда индивидуал кредит шартномаларига асосан 12 ойгача очиқ кредит линияси орқали (револьвер шаклда) кредит ажратилганда - 27%.\n" +
                    "\n" +
                    "“Бизнесни ривожлантириш банки” АТБ тизимида асосий ҳисоб \n" +
                    "рақами мавжуд бўлмаганда;\n" +
                    "Кредит муддати 12 ойгача - 28%\n" +
                    "Кредит муддати 12 ойдан 24 ойгача - 29%", ""},
            {"", "Кредитлаш усули", "Очиқ ва опиқ кредит линияси орқали", ""},
            {"", "Кредит валютаси", "Миллий валюта (сўм)", ""},
            {"", "Молиялаштириш манбаи", "Банк ўз маблағи ва (ёки) жалб қилинган маблағлари ҳисобидан", ""},
            {"", "Кредитни ажратиш шакли", "Мижознинг \"Бизнесни ривожлантириш банки\" АТБ тизимида очилган асосий ёки \nиккиламчи хисоб рақамига пул ўтказиб берилади.", ""},
            {"", "Қўшимча шарт", "Агар мавжуд бўлса", ""},
            {"2", "Қарз олувчининг таъсис ҳужжатлари (устав, гувоҳнома, паспорт нусхалари, имзо наъмунаси)", "", ""},
            {"", "Юридик манзили (Низом)", "", ""},
            {"", "Корхона ташкил топган сана", "", ""},
            {"", "Таъсисчилар ва уларнинг улуши (stat.uz )", "", ""},
            {"", "Кредит олиш қарори", "", ""},
            {"", "Низом жамғармаси суммаси", "", ""},
            {"", "Асосий фаолияти (Низом бўйича)", "", ""},
            {"3", "Кредит ахборот тахлилий маркази (КАТМ) маълумотлари", "", ""},
            {"", "Ижобий кредит тарихига эга бўлиши", "Мавжуд амалдаги кредитлари сони", ""},
            {"", "", "Мавжуд амалдаги кредитлари қолдиғи", ""},
            {"", "", "Мавжуд кредитлари бўйича муддати ўтган асосий/ фоиз қарздорлиги тўғрисида", ""},
            {"", "", "Мижознинг суд жараёнидаги кредит қолдиқлари ва балансдан ташқари \n" +
                    "ҳисобвараққа ўтказилган кредит асосий қарзи ва фоизлари мавжуд бўлмаслиги", ""},
            {"", "", "KATM бали 200 баллдан юқори бўлиши", ""},
            {"", "", "КАТМ мижознинг барча тижорат банклари тизимида “қониқарсиз”, “шубҳали” ва \n“умидсиз” тоифаларида таснифланган амалдаги кредитлари мавжуд бўлмаслиги;", ""},
            {"", "", "Ўзаро алоқадор тадбиркорлик субъектларининг номи\n" +
                    "(orginfo.uz сайти орқали ўрганилди)", ""},
            {"", "", "Ўзаро алоқадор тадбиркорлик субъектларининг “БРБ ” АТБ муддати ўтган \nқарздорликлари мавжуд бўлмаслиги", ""},
            {"", "Кредитлар бўйича охирги 24 ой ичида:", "", ""},
            {"", "30 кундан ошган муддати ўтган қарздорликлари ", "10 тадан кўп бўлмаслиги", ""},
            {"", "60 кундан ошган муддати ўтган қарздорликлари ", "2 тадан кўп бўлмаслиги", ""},
            {"", "90 кундан ошган муддати ўтган қарздорликлари ", "1 тадан кўп бўлмаслиги;", ""},
            {"", "Охирги 12 ой ичида 90 кундан ошган муддати ўтган \nқарздорликлари", "умуман бўлмаслиги;", ""},
            {"4", "Мавжуд кредитлари тўғрисида маълумот", "", ""},
            {"", "Кредитнинг шартнома суммаси", "", ""},
            {"", "Кредит қолдиғи", "", ""},
            {"", "Мақсади", "", ""},
            {"", "Муддати", "", ""},
            {"", "Муддати ўтган график суммаси", "", ""},
            {"", "Муддати ўтган фоиз суммаси", "", ""},
            {"", "Мавжуд таъминотлари", "", ""},
            {"5", "Молиявий натижалари тўғрисида ва хисоб рақам айланмалари тўғрисида", "", ""},
            {"", "Асосий ва иккиламчи хисоб рақам орқали айланмалар тўғрисида  \n" +
                    "(жами ҳисоб рақамларида, жумладан бошқа банкдаги)", "21.08.2023 - 31.12.2023", ""},
            {"", "", "Охирги 12 ойда пул айланмаларига эга бўлиши \n" +
                    "01.01.2024 - 31.12.2024", ""},
            {"", "", "01.01.2025 - 29.01.2025", ""},
            {"", "Айланмалари (Ф-2 010 сатр)", "2024-йиллик баланс бўйича", ""},
            {"", "1,0 млрд сўмгача бўлган лойиҳалар учун талаблар", "", ""},
            {"", "Фойда ёки зарар (Ф-2 270 сатр)", "Молиявий натижалар тўғрисида ҳисобот (2-сон шакл) охирги ҳисобот даври билан зарар \nбилан  якунланмаган бўлиши ", ""},
            {"", "Ўз айланма маблағлари суммаси (тахлил)", "Ўз айланма маблағлари мавжудлиги манфий кўрсаткичда бўлмаслиги;", ""},
            {"", "mib.uz", "Мижознинг Мажбурий ижро бюроси томонидан очилган ижро иши бўйича тўланиши \nлозим бўлган маблағ бўлмаслиги;", ""},
            {"", "2-сонли картотека  қарздорлиги", "2-сонли картотека ҳисобварағида қарздорлик мавжуд бўлмаслиги;", ""},
            {"", "1,0 млрд сўмдан юқори бўлган лойиҳалар учун қўшимча талаблар", "", ""},
            {"", "Мижоз фаолиятидан тушумга", "Мижоз фаолиятидан тушумга эга бўлиши", ""},
            {"", "\"Бизнесни ривожлантириш банки\" АТБ тизимида \nҳисоб рақами мавжудлиги", "\"Бизнесни ривожлантириш банки\" АТБ тизимида фақат асосий ҳисоб рақами мавжуд \nбўлиши", ""},
            {"", "Қарз олувчи кредит юкламаси", "Қарз олувчи кредит юкламаси 100% дан кўп бўлмаслиги", ""},
            {"", "500,0 млн сўмдан юқори бўлган лойиҳалар учун қўшимча талаблар (гаровсиз)", "", ""},
            {"", "Қарз юки кўрсаткичи", "Ваколат доирасида Кредит қўмитаси қарорига асосан доимий пул оқимига ва ижобий кредит тарихига эга мижозларга кредит суммасининг 125% миқдорида суғурта полиси ёки учинчи шахс кафиллиги билан кредит ажратилишига рухсат этилиши мумкин (кредит миқдори 500.0 млн. сўмдан юқори бўлган лойиҳалар учун).\n" +
                    " Бунда, доимий пул оқимига эга мижозлар дейилганда жорий ва янги кредитлари билан бирга ҳисобланганда қарз юки 50% дан (50% ҳам киради) баланд бўлмаслиги ва сўнги 12 ойда ҳисоб рақамида узликсиз тушуми мавжуд бўлиши (асосий фаолияти мавсумий бўлганда, тушуми узликсизлигига ўрнатилган талаб бундан мустасно) лозим.", ""},
            {"", "Сўнги 12 ойда ҳисоб рақамида узликсиз тушуми \nмавжуд бўлиши ", "", ""},
            {"6", "Тақдим этилаётган таъминот маълумотлари", "", ""},
            {"", "Манзили", "500 млн.сўмгача  125% номулкий - Қарз юки 20% гача;\n" +
                    "- 1 000 млн.сўмгача 75 % мулкий, 50% номулкий - Қарз юки 30% гача;\n" +
                    "- 2 000 млн.сўмгача 80 % мулкий, 45% номулкий - Қарз юки 30% гача;\n" +
                    "- Бошқа холларда 100% мулкий, 25% номулкий таъминотлар тақдим этилиши лозим;\n" +
                    "Қуйидаги ҳолларда фақат 125% мулкий таъминот талаб этилади:\n" +
                    "- 1,0 млрд.сўмгача кредит ажратишда (Мижознинг қарз юки ёки биргаликдаги қарз юки 100% дан юқори бўлганда;\n" +
                    "- 90 кундан ошган муддати ўтган қарздорликка 1 марта йўл қойган холларда;\n" +
                    "- “БРБ” АТБ тизимида асосий ҳисобрақами мавжуд бўлмаган мижозларга кредит ажратишда;\n" +
                    "- 30 кундан ошган муддати ўтган қарздорликка 10 мартадан кўп бўлган холларда;\n" +
                    "- Ваколат доирасида Кредит қўмитаси қарорига асосан доимий пул оқимига ва ижобий кредит тарихига эга мижозларга кредит суммасининг 125% миқдорида суғурта полиси ёки учинчи шахс кафиллиги билан кредит ажратилишига рухсат этилиши мумкин (кредит миқдори 500.0 млн. сўмдан юқори бўлган лойиҳалар учун).\n" +
                    " Бунда, доимий пул оқимига эга мижозлар дейилганда жорий ва янги кредитлари билан бирга ҳисобланганда қарз юки 50% дан (50% ҳам киради) баланд бўлмаслиги ва сўнги 12 ойда ҳисоб рақамида узликсиз тушуми мавжуд бўлиши (асосий фаолияти мавсумий бўлганда, тушуми узликсизлигига ўрнатилган талаб бундан мустасно) лозим.\n" +
                    "- Охирги 12 ой ичида мижознинг 50% дан юқори улушга эга таъсисчиси ўзгарганда (яқин қариндошлар ўртасида ўзгариш бундан мустасно), камида 125% фоиз ликвидли мол-мулк гарови тақдим этилиш лозим.", ""},
            {"", "Номи", "", ""},
            {"", "Гаров мулки эгаси", "", ""},
            {"", "Тегишлилиги тўғрисида хужжат", "", ""},
            {"", "Рўйхатдан ўтганлиги юзасидан кадастр кўчирмаси", "", ""},
            {"", "Рўйҳатда ҳеч ким турмаслиги", "", ""},
            {"", "Таъқиқ мавжудлиги бўйича маълумотнома", "", ""},
            {"", "Мустақил баҳоловчи ташкилот нархи", "", ""},
            {"", "Е-баҳолаш нархи (Эксперт-2)", "", ""},
            {"", "Банк баҳолаш далолатномаси нархи", "", ""},
            {"", "Гаров эгасининг розилиги (паспорт)", "", ""},
            {"7", "Тақдим этилаётган таъминот маълумотлари", "", ""},
            {"", "Манзили", "500 млн.сўмгача  125% номулкий - Қарз юки 20% гача;\n" +
                    "- 1 000 млн.сўмгача 75 % мулкий, 50% номулкий - Қарз юки 30% гача;\n" +
                    "- 2 000 млн.сўмгача 80 % мулкий, 45% номулкий - Қарз юки 30% гача;\n" +
                    "- Бошқа холларда 100% мулкий, 25% номулкий таъминотлар тақдим этилиши лозим;\n" +
                    "Қуйидаги ҳолларда фақат 125% мулкий таъминот талаб этилади:\n" +
                    "- 1,0 млрд.сўмгача кредит ажратишда (Мижознинг қарз юки ёки биргаликдаги қарз юки 100% дан юқори бўлганда;\n" +
                    "- 90 кундан ошган муддати ўтган қарздорликка 1 марта йўл қойган холларда;\n" +
                    "- “БРБ” АТБ тизимида асосий ҳисобрақами мавжуд бўлмаган мижозларга кредит ажратишда;\n" +
                    "- 30 кундан ошган муддати ўтган қарздорликка 10 мартадан кўп бўлган холларда;\n" +
                    "- Ваколат доирасида Кредит қўмитаси қарорига асосан доимий пул оқимига ва ижобий кредит тарихига эга мижозларга кредит суммасининг 125% миқдорида суғурта полиси ёки учинчи шахс кафиллиги билан кредит ажратилишига рухсат этилиши мумкин (кредит миқдори 500.0 млн. сўмдан юқори бўлган лойиҳалар учун).\n" +
                    " Бунда, доимий пул оқимига эга мижозлар дейилганда жорий ва янги кредитлари билан бирга ҳисобланганда қарз юки 50% дан (50% ҳам киради) баланд бўлмаслиги ва сўнги 12 ойда ҳисоб рақамида узликсиз тушуми мавжуд бўлиши (асосий фаолияти мавсумий бўлганда, тушуми узликсизлигига ўрнатилган талаб бундан мустасно) лозим.\n" +
                    "- Охирги 12 ой ичида мижознинг 50% дан юқори улушга эга таъсисчиси ўзгарганда (яқин қариндошлар ўртасида ўзгариш бундан мустасно), камида 125% фоиз ликвидли мол-мулк гарови тақдим этилиш лозим.", ""},
            {"", "Номи", "", ""},
            {"", "Гаров мулки эгаси", "", ""},
            {"", "Тегишлилиги тўғрисида хужжат", "", ""},
            {"", "Рўйхатдан ўтганлиги юзасидан кадастр кўчирмаси", "", ""},
            {"", "Рўйҳатда ҳеч ким турмаслиги", "", ""},
            {"", "Таъқиқ мавжудлиги бўйича маълумотнома", "", ""},
            {"", "Мустақил баҳоловчи ташкилот нархи", "", ""},
            {"", "Е-баҳолаш нархи (Эксперт-2)", "", ""},
            {"", "Банк баҳолаш далолатномаси нархи", "", ""},
            {"", "Гаров эгасининг розилиги (паспорт)", "", ""},
            {"8", "Тақдим этилаётган таъминот маълумотлари", "", ""},
            {"", "Манзили", "500 млн.сўмгача  125% номулкий - Қарз юки 20% гача;\n" +
                    "- 1 000 млн.сўмгача 75 % мулкий, 50% номулкий - Қарз юки 30% гача;\n" +
                    "- 2 000 млн.сўмгача 80 % мулкий, 45% номулкий - Қарз юки 30% гача;\n" +
                    "- Бошқа холларда 100% мулкий, 25% номулкий таъминотлар тақдим этилиши лозим;\n" +
                    "Қуйидаги ҳолларда фақат 125% мулкий таъминот талаб этилади:\n" +
                    "- 1,0 млрд.сўмгача кредит ажратишда (Мижознинг қарз юки ёки биргаликдаги қарз юки 100% дан юқори бўлганда;\n" +
                    "- 90 кундан ошган муддати ўтган қарздорликка 1 марта йўл қойган холларда;\n" +
                    "- “БРБ” АТБ тизимида асосий ҳисобрақами мавжуд бўлмаган мижозларга кредит ажратишда;\n" +
                    "- 30 кундан ошган муддати ўтган қарздорликка 10 мартадан кўп бўлган холларда;\n" +
                    "- Ваколат доирасида Кредит қўмитаси қарорига асосан доимий пул оқимига ва ижобий кредит тарихига эга мижозларга кредит суммасининг 125% миқдорида суғурта полиси ёки учинчи шахс кафиллиги билан кредит ажратилишига рухсат этилиши мумкин (кредит миқдори 500.0 млн. сўмдан юқори бўлган лойиҳалар учун).\n" +
                    " Бунда, доимий пул оқимига эга мижозлар дейилганда жорий ва янги кредитлари билан бирга ҳисобланганда қарз юки 50% дан (50% ҳам киради) баланд бўлмаслиги ва сўнги 12 ойда ҳисоб рақамида узликсиз тушуми мавжуд бўлиши (асосий фаолияти мавсумий бўлганда, тушуми узликсизлигига ўрнатилган талаб бундан мустасно) лозим.\n" +
                    "- Охирги 12 ой ичида мижознинг 50% дан юқори улушга эга таъсисчиси ўзгарганда (яқин қариндошлар ўртасида ўзгариш бундан мустасно), камида 125% фоиз ликвидли мол-мулк гарови тақдим этилиш лозим.", ""},
            {"", "Номи", "", ""},
            {"", "Гаров мулки эгаси", "", ""},
            {"", "Тегишлилиги тўғрисида хужжат", "", ""},
            {"", "Рўйхатдан ўтганлиги юзасидан кадастр кўчирмаси", "", ""},
            {"", "Рўйҳатда ҳеч ким турмаслиги", "", ""},
            {"", "Таъқиқ мавжудлиги бўйича маълумотнома", "", ""},
            {"", "Мустақил баҳоловчи ташкилот нархи", "", ""},
            {"", "Е-баҳолаш нархи (Эксперт-2)", "", ""},
            {"", "Банк баҳолаш далолатномаси нархи", "", ""},
            {"", "Гаров эгасининг розилиги (паспорт)", "", ""},
            {"9", "Кредит қайтмаслик юзасидан суғурта ташкилотининг суғурта полиси тақдим этилаётганда", "", ""},
            {"", "Суғурта ташкилоти номи", "", ""},
            {"", "Молиявий барқарорлиги ", "\"Риск\" департаменти маълумотига асосан", ""},
            {"", "Суғурта суммаси", "", ""},
            {"7", "Жами таъминотлар суммаси", "Жами таъминот", ""},
            {"", "", "Мулкий таъминот", ""},
            {"", "", "Номулкий таъминот", ""},
            {"8", "Банк томонидан берилган хужжатлар", "", ""},
            {"", "Банк хулоса", "", ""},
            {"", "Юрист хулоса", "", ""},
            {"", "Қўмитага хат", "", ""},
            {"9", "Андеррайтер ХУЛОСАСИ", "", ""},
            {"1.", "         1. \"SHODLIK TECHNO\" МЧЖга 6 ой имтиёли давр билан, 36 ой муддатга, йиллик 30,0 фоиз устама тўлаш шартлари асосида 3 500 000 000,0 сўм миқдорида кредит маблағлари ажратиш  \"Universal\" кредит маҳсулоти паспорти талабларига мос ҳисобланади.\n" +
                    "\n" +
                    "        2. Мазкур лойиҳа Кредит қўмитаси ваколати доирасида ҳисобланиб, шунингдек, мижознинг бугунги кундаги мажбуриятлари 3,0 млрд сўмлигини инобатга олиб кредит ажратиш масаласини кўриб чиқиш ва якуний қарор қабул қилиш учун Кредит қўмитаси муҳокамасига киритилмоқда.\n" +
                    "\n" +
                    "        3. Лойиҳа юзасидан Риск менджмент департаменти ҳулосаси илова қилинади. \n" +
                    "\n" +
                    "        4. Тақдим этилган ҳужжатларни ҳаққонийлигига, гаров мулкларини тўғри баҳоланиши ва кредит йиғмажилдидаги ҳужжатларни қонуний тарзда расмийлаштирилишига БХМ/БХО раҳбари, баҳолаш комиссияси ва тегишли масъул ходимлар жавобгар ҳисобланади.", "", ""},
            {"", "", "", ""},
            {"", "Юридик шахслар андеррайтинги бошқармаси \nетакчи менежери", "", ""},
            {"", "", "", ""},
            {"", "Келишилди:", "", ""},
            {"", "", "", ""},
            {"", "Юридик шахслар андеррайтинги бошқармаси \nбошлиғи", "", ""},
            {"", "", "", ""},
            {"", "", "", ""},
            {"", "Кредитларни маъқуллаш ва лойиҳаларни \n" +
                    "молиялаштириш департаменти директори", "", ""}
    };
}
